#+TITLE: pidof
#+DATE: 2024-08-17T17:52:44+0800
#+LASTMOD: 2024-10-30T21:53:30+0800
#+TYPE: docs
#+DESCRIPTION: Linux has this command, but not in macOS, so I write it for you.

Program name is case insensitive by default, pass =-S= option if you want sensitive match.

#+begin_src bash :results verbatim :exports results :wrap example :dir ../../..
./zig-out/bin/pidof -h
#+end_src

#+RESULTS:
#+begin_example
 USAGE:
     ./zig-out/bin/pidof [OPTIONS] [--] [program]

 OPTIONS:
  -s, --single                     Only return the first matching pid.
  -d, --delimiter STRING           Delimiter used if more than one PID is shown.(default:  )
  -S, --strict                     Case sensitive when matching program name.
  -u, --user_only                  Only show process belonging to current user.
  -v, --version                    Print version.
  -h, --help                       Print help message.
#+end_example
